[
  [
    {
      "chnName": "WFLA排球社",
      "engName": "WFLA Volleyball Club",
      "chnDesc": 
        "排球社旨在在为世外学生提供每周一次的排球训练机会。除了基础和专项训练外，排球社会更注重排球技术的实践。排球社不仅会组织校内的，还会参加校际、区级、市级各个类别的排球赛。丰富的活动形式不仅可以帮助发展排球技术，也可以达到IB理念中的均衡发展，让同学们在课余时间还能够放松和锻炼。",
      "engDesc": 
        "The volleyball club aims to provide opportunity of training for students who like volleyball. Other than the basic and advanced training, the club values more on practice on the field. The volleyball club not only organizes matches in the school, but also participates championships in Shanghai. Such diverse activities can help to develop students’ skills in volleyball. Also, it provides a chance of attaining “Balanced” in IB Learners Profile by by providing a chance to improve physical strength."
    },
    {
      "chnName": "燃脂社",
      "engName": "Slimaholic",
      "chnDesc": 
        "每一个青春期的女孩，都或多或少会对于自己的身材感到烦恼、羞愧，同时又无比憧憬健美、苗条纤细的小腹、大腿。正是因为我们感同身受，所以才会有这个女生室内运动社的想法。我们最大的亮点——仅限女生。同样作为女生，我们不愿意在放学后全是男生们的操场上进行体育锻炼，同时羞涩于每一个同学、老师甚至是家长或是好奇、或是鼓励的目光。给女生一个私密空间，暂时放下所有礼仪、淑女的包袱，挥洒汗水，重塑身材吧！",
      "engDesc": 
        "Almost every girl is worry about her figure, longing slim and healthy lower abdomen and thighs. We actually feel the same, thus we are inspired to create a club for girls. What's special is, we only accept girls! As girls, we don't want to run or play ball games on the playground in front of boys who are good at sporting. Also, classmates', teachers' and parents’ attentions can give us pressure. Give girls a private space to let all the etiquettes and requirements go. Join us! Start to be lean and fit right now!We keep track on our diet and fat density. A monthly checkout is necessary. Additionally, it is definitely important to develop a personal table, noting down every little changes about muscle feeling, body condition, heart rate and also mood. Hopefully, you would see a confident and healthier you after 5 months.  "
    },
    {
      "chnName": "世外中学啦啦队",
      "engName": "WFLMS CHARM",
      "chnDesc": 
        "世外啦啦队由一群活力、团结、乐观、开朗的学生们自发组织建立。我们希望通过啦啦队推广啦啦操这项特殊的与艺术结合的运动，让更多人了解与感受到青春的蓬勃与朝气；让喜欢啦啦操的同学们能够通过这个平台一同感受最灿烂美好的校园生活；我们更拥有乐于奉献和不断拼搏的体育精神，让参加比赛的同学不再孤军奋战。我们希望有更多的同学们加入带我们的队伍，共同代表世外爱心、大气、优雅的形象！",
      "engDesc": 
        "WFLMS CHARM, the cheerleading squad of WFLMS, is filled with a group of vigorous, cooperative and jolly students. We organize the team,choreographand find background musics all by ourselves. By running WFLMS CHARM, we hope to spread the altruistic, energetic and young spirit of cheerleading as well as to cheer up the athletics during the competition. We’re fearless cause we have each other’s care, we’re strong cause we never give up. And we hope and welcome everyone who is willing to shine during the best time of his/her life to join us, together we will make our school life unforgettable, courageous and full of fun!"
    },
    {
      "chnName": "世外篮球社",
      "engName": "Basketball club",
      "chnDesc": 
        "篮球社是以篮球为主题的运动社团，旨在提升世外师生的整体篮球水平和身体素质。篮球社提供每周一至两次的训练，让爱好篮球的同学磨练自己的技术、增强团队意识，同时成为一个好的领导者和一个合格的团队协作者。我们还会在篮球社中选拔出精英成员进入学校篮球队，参与各类区、市级比赛，为学校争取荣誉。在学校内会不定期举办校园篮球赛来增进班级团结、班级之前的和睦，让更多的人爱上篮球运动。\n",
      "engDesc": 
        "The aim of the basketball club is to improve health condition of students who like to play basketballs. The club offers two or more trainings a week in order to let club members have enough time for honing skills, for developing team spirit, and for trying to be good leaders and collaborators. Otherwise, the school team will participate in most of the competitions, and no matter the game will be held by schools, by districts or by the city, they will fight for the honor. During school days, we will also have daily basketball competitions; either for enhancing the group spirit of classes, or for attracting more students to join in the basketball club."
    },
    {
      "chnName": "网球社",
      "engName": "Tennis club",
      "chnDesc": 
        "网球社作为世外中学众多体育类社团中的一个，由历任社长打下了坚实的基础，成为了世外中学体育类社团中的一股力量，网球社由现任社长刘懿之组织社员参加活动。 网球社每周一次 进行活动，本学年进行cas三项的扩展，沿用以往季节网球社的想法，常规训练社员的网球技巧以及进行拉力赛，在运动的同时也能够掌握更牢固的技巧。同时，在球场上也是能够互相交流以及沟通的一个平台，由于本届社员人数进行扩张，且都具备一定的网球的技巧，教练计划作为活动的支援。新的一届网球社，社长准备长期筹办并商讨，举办网球校际或校内联赛，给社员一个展现自己的平台。",
      "engDesc": 
        "Tennis club as one of many sports clubs in WFLA，has strong fundamental that established by the presidents before. To become an essential part of the sports clubs, the tennis club now is organized by Laura. Tennis club holds activity every Wednesday afternoon 5:00 - 6:30, two requirements this year only for CA, and the things we do during the time training members of tennis skills and do some rally, also master stronger skills. At the same time, members can communicate with each other on the court as well as a platform of communication, since the number of members is limited to four people, and we all have certain tennis skills, so coach is not as a support activity now. The president of new tennis club is going to set up some races to increase the participation of students to play tennis.Wish all the members enjoy the time in the tennis club."
    },
    {
      "chnName": "骑行社",
      "engName": "Cycling club",
      "chnDesc": 
        "骑行社是一个集运动与技术一体的社团，我们立足于“读万卷书，行万里路”，倡导“融入自然，深入社会，挑战自我，体现别样人生”社团主旨。我们用骑行的方式，用自己亲生的社会实践经历去接触，了解，融入自然，社会和人生。在共同一个梦想---“行万里路”的基础上，世外骑行社将展开中短途自行车骑行，参观游览等多种社会实践活动，磨砺我们的意志，是我们融入自然和社会，增强团队合作精神，提高自理，自立的能力，让我们勇于追求理想，积极对待人生的态度，我们将以自己的脚步向着我们的梦想前进。",
      "engDesc": 
        "Cycling club is a combination of sports and technology. Our motto is “Read thousands of books, and travel thousands miles of roads”, and we propose to get into the nature, blend in the society and challenge oneself to live a different life. By cycling, we will meet many different people, experience many unexpected things. We will acquire the knowledge of society and nature. Based on the same goal ------ “travel thousands miles of roads”, WFLMS Cycling Club will organize several social practice activities such as short-distance cycling and monument visiting. Through cycling, we strengthen our willpower, or the volitional quality, either which is the ability to make us blend in nature and society. During cycling, the spirit of team cooperation helps our students develop a sense of self-independence and self-management. We are brave to pursue our goal. We have a positive attitude of our future, and we will follow our idea with our own steps. "
    },
    {
      "chnName": "足球社",
      "engName": "Football Club",
      "chnDesc": 
        "足球是大家儿时共同的回忆，是很多人梦的开始。世外的足球社，将会致力于帮助大家唤回那份过去；勇敢地向着未来成长；在校园中建立起足球氛围；也构建起属于世外的足球文化；使之能够长时间地传承下去。足球社将定期开展足球知识，足球技战术的训练，并努力参加地区性或校与校之间的友谊赛、锦标赛。让同学们在高中的成长中享受足球的乐趣。",
      "engDesc": 
        "Football club enables us to do exercise and play our favorite sport all the time. We practice every Wednesday and Friday. The members here all have their own favorite team. Everyday after school or at weekends, we discuss all about football, and it is a wonderful environment. "
    },
    {
      "chnName": "噼里啪啦乒乓社",
      "engName": "P.P.Club",
      "chnDesc": 
        "乒乓社以宣扬中国传统文化为核心，通过乒乓这一种大众化运动方式，提供学生们强身健体的机会。我们进行基本功训练，包括旋球、削球、搓球和抽球。社员互相学习交流打球经验，进行模拟对练，在实战中进一步提升水准；体能训练，包含折返跑、小步跳跃等，提升心理素质；定期举行社内单打，双打比赛。期待你的加入！\n",
      "engDesc": 
        "The core of P.P. Club  is to promote traditional Chinese culture. Through the popular sport of table tennis, it provides students with opportunities to strengthen their bodies. We have basic skills training, including spin, slice, rub and draw. Members learn from each other and exchange playing experience, carry out simulation practice, and further improve the level in the actual combat; Physical training, including folding run, small jump, etc., to improve psychological quality; Regular in-club singles and doubles matches. Welcome！"
    },
    {
      "chnName": "随园跑社",
      "engName": "WFLA Running Club",
      "chnDesc": 
        "随园跑社自创设以来就以帮助学生养成运动习惯，舒缓学业压力，增强体质为目标，每周定期举行慢跑活动。社团不定期举办城市越野等活动，将体育运动不止局限于放学后的慢跑。社团氛围轻松愉悦，社团成员们在一起相聚十分融洽。",
      "engDesc": 
        "WFLA Running Club aims at help student develop the habit of exercise, release study pressure, and improve the immunity. Every week, we run after school. We also have city hiking and other activites as well. Our club is relaxing. Club members get along with each other very well."
    },
    {
      "chnName": "六合武学社",
      "engName": "Art of Martial",
      "chnDesc": 
        "在世外学生走向世界之前，让我们的学生更加了解我们自己的文化，同时爱上我们的武术文化，并且相映地习得一些武术的技能。以及在跆拳道，散打盛行的今天，通过传统武术这门冷门艺术带给学生并不亚于其他武术门类的反应力和身体协调力。同时通过我们的公众号让更多人和学生了解我们华夏文明自身产出的功夫。我们希望让同学们能够在了解世界前，首先更加了解我们自己。另外，我们结合了西方健身文化的元素，每周武术与健身的交替活动让同学们从中西两种文化中能够得到熏陶以及身体素质的提升。",
      "engDesc": 
        ""
    },
    {
      "chnName": "弈语棋斋",
      "engName": "Go club",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "轻羽飞扬",
      "engName": "",
      "chnDesc": 
        "世外中学羽毛球社团（轻羽飞扬）致力于为在校喜爱羽毛球的同学提供良好的运动环境，同时饱含丰富课程和专业校队指导。",
      "engDesc": 
        ""
    },
    {
      "chnName": "世外飞镖社",
      "engName": "",
      "chnDesc": 
        "世外飞镖社旨在培养同学们对于飞镖的兴趣，从而愿意接受、挑战新事物，开拓自己的眼界；飞镖运动讲究礼仪，在社团活动中，同学们有机会提高个人素养，培养社交礼仪；飞镖运动有助于缓解同学们学习时的身体疲劳以及精神紧张，是放松心情、释放压力的不错选择；飞镖运动强调技术和意志力，同学们在活动过程中将提升排除外界干扰的能力，培养抗干扰能力和心理耐受力。",
      "engDesc": 
        "WFLA Darts Club aims to develop students' interest in darts, so that they are willing to accept and challenge new things, and to develop their own horizons; darts is a sport that emphasizes etiquette, and in the club activities, students have the opportunity to improve their personal qualities and develop social etiquette; darts helps to relieve students' physical fatigue and mental tension when studying, and is a good choice for relaxation and stress release; darts emphasizes skills and In the course of this activity, students will improve their ability to eliminate outside interference, and develop the ability to resist interference and mental endurance."
    }
  ],
  [
    {
      "chnName": "VOICE有声书社",
      "engName": "VOICE",
      "chnDesc": 
        "VOICE有声书项目由上海市世界外国语中学中学一群热爱阅读的学生发起，旨在致力于发展有声读物。在让人们从别样的角度感受阅读之美的同时，我们关注社会上有阅读障碍的群体。希望在我们的努力之下，能让更多人因为听，爱上读。",
      "engDesc": 
        "VOICE, initiated by a group of students who enjoys reading and hopes to share the joy of reading with others, is started with the idea of making audio books to help people who have problems on reading while providing people who are interested in both reading and listening more enjoyment. Considering that sound is a cyclic resource as well as a convenient way to spread information, we soon notice that currently in China, people have not yet realized the importance of producing various audio books. People who suffer from disabilities or still are not able to read therefore are lack of reading resources. It’s worthwhile for us pay more attention on the development of audio books and help them. While producing audio books, we also enjoy a unique way of reading by telling and speaking, enhance our recordings by certain post-processing, and brainstorm how to apply audio works to favor people in more aspects."
    },
    {
      "chnName": "学生大使馆",
      "engName": "Student Embassy",
      "chnDesc": 
        "社团宗旨在于帮助学生找到心仪的大学并且寻找适合自己的CAS项目。首先作为即将出国的同学，我们需要对未来自己将面临的众多大学有所了解，但是大家有没有太多的时间去一所一所的了解，于是我们社团的存在就有了意义。在活动中我们会帮助大家收集并分析大学的资料，并在一定时间内将至公布，并提供给大家以供参考。第二部分，就是CAS项目的协助，新加入DP大家庭的同学在开学的第二周就要面临社团的选择，对于他们来说，一切的社团都是陌生的、不熟悉的，他们的选择也是盲目的，那我们的社团给他们提供的信息能够帮助到他们寻找到适合自己的社团，或者创立属于他们的社团。而在之后的学习过程中，同学们也要开展自己的CAS Project，那这时候我们可以通过我们的经验，来帮助他们找到自己的兴趣，并开展有关的Project。相信着一定能帮到之后的学弟学妹们。",
      "engDesc": 
        "Our goal is to help students find the college they want to attend and help them with their CAS activities. Many students at our school will be heading towards an international direction, so it is important that they learn as much about colleges as possible. Unfortunately, this is a time consuming process. Our club will research these colleges and then give this information to students. We will also be contacting school admission councilors in international schools and inviting them to our school to speak. We hope to create more student-councilor interaction and create a more entertaining and creative way for councilors to present the information about their school.  We will also be striving to create more people-friendly ways to interact with the councilors even with a tight schedule.Secondly, we also help students in CAS activities. To those students who are new to the international campus, they have to choose their clubs on the second week of the new semester. However, they even never heard about the name of the club, how could they choose a suitable club without knowing anything about them? Our club is going to provide the information of clubs and categorize them into different groups. During the study in the IB program, students have to create their own CAS Project, and we will help them find their interests and create a suitable CAS Project."
    },
    {
      "chnName": "微笑社",
      "engName": "Careholic",
      "chnDesc": 
        "微笑社一直着眼于“教育”与“社区”两大元素。我们认为，在将目光投向遥远的青藏高原或是大别山区之前，我们不应忘了，我们自己的社区就急需我们的帮助。所以，我们致力于关注身边居民们的需求，解决他们的不便，真正成为细致观察，敢于实践的Careholists。我们的理念就是希望教育能够紧跟新时代的潮流，英语是全球化的象征，程序设计和手机是信息化的象征，这些都是在新时代必不可少的技能。我们希望能够通过自己的努力，帮助小朋友尽快适应新时代，帮助老年人努力赶上新时代，将知识与微笑传递给更多的人。",
      "engDesc": 
        "Careholic has been focusing on the two elements: \"education\" and \"community\". We believe that before we turn our eyes to the remote areas far away, we should not forget that our own communities are in urgent need of our help. Therefore, we are committed to paying attention to the needs of the residents around us and solving their inconveniences. Our objective is that education should keep up with the trend of the new era. English is the symbol of globalization, programming and mobile phone are the symbol of informationization. We hope that through our own efforts, we can help the children adapt to the new era as soon as possible, help the elderly to catch up with the new era, and pass knowledge and smile to more people."
    },
    {
      "chnName": "寻声社",
      "engName": "Sound Of Silence",
      "chnDesc": 
        "聋哑助学社已创立了四年，意在帮助聋哑学校的同学提高英语口语水平、掌握更全面的知识并且有更好的与人沟通能力。每周，聋哑助学社都会在聋哑青年技术学校开展1-2小时的教学活动。教学内容从英语拓展为各学科，充分满足聋哑学校的同学对于知识的需求。社团同时还会了解聋哑学生的学习生活状况，以便更好地融入这一群体。聋哑助学社还加入了国际组织PEP，和更多帮助困难群体的志愿者团队一起交流心得体会，提升教学能力。",
      "engDesc": 
        "The Hearing Impaired Assistance Club has been operated for almost four year. We, the club members, intend to help the disabled peers enhance their English oral skills and advance their communication capabilities. Weekly, the Hearing Impaired Assistance Club carries out activity at the Shanghai Youth Technical School for the Deaf. The content extends from only English education to multi-curriculum study, in order to better serving the students’ need for new knowledge. The club also gets to know the experience of the hearing-impaired students in order to consider what they need and how they feel from their prospective. Our club has joined the International organization, PEP, which provides us with the chance to probe into the issue of assisting those who are in need and exchange our ideas. Though the workshop, we are able to find ways to improve the quality of our teaching."
    },
    {
      "chnName": "根与芽",
      "engName": "Roots & Shoots",
      "chnDesc": 
        "世外根与芽创立于2006年，在世外本部与国际部都开展了活动。根与芽的理念其实很简单，关心环境、关爱社区，但求通过我们的活动，倡导身边的人们为改善环境做出贡献。\n根与芽的活动主要分为两大类：常规活动以及短期大型活动。常规活动有如：healthy diet，ecolife生活小物和ecofarm。短期有各种和沪上环保社团的合作项目以及和上海根与芽的合作。",
      "engDesc": 
        "Roots and Shoots is an international environmental organization. Our club in WFLMS is a member of Shanghai Roots and Shoots.Protect the environment, Care for the community---That’s what we think. We want to use our action to propagate our idea. \n    There are two parts of activities in our club: routine activities and short-term event. Routine activities includes: ecofarm, ecolife and healthy diet.  Short-term events includes cooperations with Shanghai R&S and other eco-friendly organizations in Shanghai."
    },
    {
      "chnName": "世外信息化社",
      "engName": "Computerization",
      "chnDesc": 
        "我们的全称是信息化社，不过我们更喜欢被称之为C社（Computerization）；我们开发并维护了校内信息化平台Enspire；\n\n我们是一个长期在幕后工作的，以面向社团的知识性服务为主的，一个小而精的CS社团；\n我们认为，代码仅仅是算法的形式载体，是Computer Scientists的思想和Algorithms造就了他/她们，而不是代码本身；因此，我们有着程序设计交流的社团文化；\n\n此外，我们与各学生组织都有着深入的合作。我们与数学社合作，开办了面向十年级的数学建模课程；我们与Techomedia合作，为Techomedia的推文和大型活动提供技术支持；我们与学生会合作，提供社团活动教室预约平台、五星社团/新社团/末位社团答辩评分平台；我们与慈善晚会Charity合作，为他们提供拍卖的线上实时出价与竞价平台；……",
      "engDesc": 
        "We are Computerization, an intimate Computer Science club within Shanghai World Foreign Language Academy. Our proudest work is the campus computerization platform Enspire, which is coded and maintained solely by us.\n\nFor most of the time, we are associated with the delicate and well-designed information flows behind the scenes as we provide knowledge services to various student organizations. \n\nWe hold a strong belief that codes are only the means to present coders' ideas, and it is computer scientists' thoughts and algorithms that made them great computer scientists, not codes. Hence, we have a tradition of discussing program design and algorithms.\n\nBesides that, we have deep cooperation with various student organizations on campus. We cooperate with WFLA Math Club to deliver the math modeling course to tenth-graders; we cooperate with Techomedia and acted as Tech Support for their WeChat articles and offline events; we cooperate with the Student Union to address the problem of club activity classroom reservation, of five-star clubs defense and scoring system; we cooperated with Charity and designed an online auction system that made real-time bidding available; and a lot more."
    },
    {
      "chnName": "学生会",
      "engName": "Student Union",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "1803零距离",
      "engName": "1803 ZD",
      "chnDesc": 
        "1803公里，是上海到大别山的距离。一路上的层层山峦，片片森林，却阻挡不住世外学子的爱与寄托，让这一段距离显得不再遥不可及。我们在支教的过程中被孩子们那一份纯真与质朴深深感动，并希望珍惜并保留住这份在喧嚣的世界中的宁静，但同时我们也看到了在群山围绕，略显闭塞的学校中的缺陷。我们相信，大别山的孩子们并不极端缺乏物资的支持，我们社团能做的是通过支教2.0、爱心邮箱以及寄小读者项目，给大别山的孩子们带去更多的知识与想法，让他们虽然身处大山，却能获得更为广阔的视野，从更多的角度来看待生活中的事物，并将我们对于大别山孩子们的关爱不断延续，让世外中学传统的大别山支教项目更为长期持久，只有这样才能避免做慈善的形式化而达到最终的目的，完成我们支教的初衷。",
      "engDesc": 
        "1803 km, is the distance between Shanghai to Dabie Mountain.\nAlthough the rough and bumpy road keeps the village isolated from the modern city, our love and hope for the children there is sincere and faithful. We realized the purity and innocence of them and we want to cherish and protect this peace in the world that filled with chaos. We believed that the children in Dabie Mountain are not in the extreme lack of financial support, but instead, the need for more open-minded ideas and thoughts, and that is the weakness we saw in the education there. We mainly designed three projects that are online teaching-assistance, the love mailbox and also the self-designed book ‘For the Young Readers’. In this way, we want to expand the children’s outlook and help them to build their own new attitude towards life. So finally we may achieve the goal that put our thoughts and passion into practice and make some real and long-term contribution to the traditional Dabie Mountain teaching-assistance projects held every year in our school. "
    },
    {
      "chnName": "SRP科研社",
      "engName": "SRP科研社",
      "chnDesc": 
        "SRP科研社是一个学校，家长，社会，学生四维一体，以服务本校学生为宗旨目标的服务类平台。本社团希望成为信息的发布者，提供者，及四方的沟通桥梁，为学生们提供更好的资源平台，提高我校科创氛围我们将作为社会与学校的沟通桥梁，为学校寻找可行的科研项目；我们将在学生进行科创项目过程中提供相关帮助，以满足他们的需求；我们将集结家长群体的力量，为学生提供相关技术支持及资源；我们将通过社会宣传联络，为学生获取相关资源平台；发布相关社会科创信息，可以让学生们参与社会化科创课题，并通过推广，使国内外科创项目在本校学生群体内同部演化。",
      "engDesc": 
        "As a science and innovation service platform, WFLA-SRP is committed to becoming an information publisher and a communication bridge between schools, parents, students, and society, providing students with a better resource platform for scientific research projects."
    },
    {
      "chnName": "JOL悦习社",
      "engName": "JOL",
      "chnDesc": 
        "JOL是一个由高中学生自主发起的教育组织，曾被评为上海市世界外国语中学的五星社团，活动内容均为非盈利的公益项目。至今为止，我们曾开过众多种类不同、面向各个年龄段的课程，包括心理学、设计思维、公共演讲、戏剧、英语音标等。\n我们拥有轻松的社团氛围，丰富的活动，自由的平台。\n我们怀抱着对知识的热忱，渴望把心中的热爱传播给更多的人。",
      "engDesc": 
        "JOL is an educational organization independently initiated by high school students. It was once awarded as the five-star club of Shanghai World Foreign Language Middle School. Its activities are all non-profit public welfare projects. So far, we have offered a wide variety of courses for all ages, including psychology, design thinking, public speaking, drama, English phonetic alphabet, and so on.\nWe have a relaxed community atmosphere, rich activities, and a free platform. \nWe embrace the enthusiasm of knowledge, and we are eager to spread our love to more people. "
    },
    {
      "chnName": "天路",
      "engName": "CanopyBridge",
      "chnDesc": 
        "天路为西藏学生提供以英语为主的网课，填补当地较为落后的口语教学和师资。社团提供线上志愿者机会，同公益组织“一扇窗”合作，在增加学习兴趣的基础上使学生更为灵活地应用英语，了解语言的文化环境。同时，天路提供一个西藏和上海学生文化交流的平台，通过实地采访、研究等手段，旨在为双方学生获得一定的文化认同感以及自我反思。学生思考在快节奏的信息化时代中维持传统文化与全球文化的平衡的必要性和意义，增加思辨能力。通过建立世外中学与上海市浦东外事服务学校的联系，消减文化刻板印象和隔阂，开拓学生的视野，使其有自我赋权的能力，建立文化自信，在平台上与世界的其他角落交流。",
      "engDesc": 
        "Canopy Bridge aims to make a connection with the Tibetan students from the culture perspective. We provide our club members with a great amount of opportunity of volunteering work and to associate with the Tibetans. In nowadays society,  plenty people adopt a curious attitude towards the minority group, ready to offer help yet with a lack of knowing how do real Tibetans live. Thus it is our duty to investigate their true needs by establishing friendship, to unveil their authentic likes and customs through multi-interactions.   "
    },
    {
      "chnName": "谷歌校园大使",
      "engName": "CS1st",
      "chnDesc": 
        "本社的名称为“CS First”。这里的CS是 Computer Science的缩写，意为是计算机科学，可以直译为“计算机科学先行者”。\n社团灵感的来源是Google CS First——一套由谷歌公司研发的，适合青少年探索计算机技术的公益课程。这套基于Scratch的课程在欧美中小学已非常流行，但是在并没有引进中国，也没有适合中国学生的版本。因此，本社团争取到了与谷歌（中国）公司合作的机会，将CS First项目在我校推行，希望我校的同学能够从中获益，并且由此辐射到周边更多学校的青少年。\n在计算机科学逐渐成为社会主流发展趋势的当下，更多地推广计算机科学无疑很重要。现在许多人在做的是针对高中生的计算机科学教程/科普/活动，但是中小学生，成年人乃至老年人都可以接触计算机科学，而算机科学在他们的生活中可以扮演非常重要的角色，计算机科学的普适性也能够得到体现。因此通过创办这个社团，我们希望能够填补更年轻的青少年以及部分成年人在这块领域的认知空缺。",
      "engDesc": 
        "The name of the club is \"CS First\". CS here is the abbreviation of Computer Science, which can be literally translated as \"computer science pioneer\".\nThe source of inspiration for the community is Google CS First-a set of public welfare courses developed by Google that are suitable for teenagers to explore computer technology. This Scratch-based curriculum has been very popular in European and American schools, but it has not been introduced to China, and there is no version suitable for Chinese students. Therefore, this association has reached an opportunity to cooperate with Google (China) and opened the CS First project in our school. We hope that our school’s classmates can merge from it and can radiate to more teenagers in surrounding schools.\n"
    },
    {
      "chnName": "世外频道",
      "engName": "",
      "chnDesc": 
        "当视觉成为了更加重要的传播方式时，世外频道更是紧随其后，用相机拍摄，利用高效的节目策划和视频剪辑的方式制作学生们感兴趣，可以体现世外独特故事的片子。我们是世外中学官方支持并重点培养的以学生为主体的校园视频媒体平台。世外频道的宗旨在于记录世外，宣传世外的同时，培养学生成为优秀的世外媒体人。世外频道让学生记录世外学生的日常生活，从不同角度发现世外的故事，策划拍摄自己感兴趣的主题，体验成片的每一个过程。",
      "engDesc": 
        "When visual elements becomes a more important mode of communication, we closely followed by shooting with a camera, using efficient program planning and video editing to create a film that is of interest to students and can reflect the unique story of the world. We are a student-based campus video media platform that is officially supported and focused by the WFLA. Our purpose is to record the world, to promote the world, and to train students to become excellent foreign media people. We allows students to record the daily life of students, discover stories from different perspectives, plan different topics of interest, and experience each process of filming."
    },
    {
      "chnName": "学生助理团",
      "engName": "",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "WFLA学生公司",
      "engName": "WFLA Student Firm",
      "chnDesc": 
        "学生公司于2012年成立，社团社长两一位，副社长两位。学生公司至今已开展多个项目——从“校服熊 ”项目至“Beary Pod”项目。我们秉着永远追求挑战，不断拓宽新领域的目标。 公司的理念为“创意慈善”，来源于“社会型企业”的概念。学生公司的目标是以商业为手段，集中更好的资源，提高效率，通过资助慈善机构的方法，回馈社会。",
      "engDesc": 
        "Two firm directors establish WFLMS student firm in 2012. Now we have established several projects, from “Homey Bear”, School scholarship to “Beary Pod” Project. Holding the belief of always accepting challenges and continuously broadening our market, each project hits great success. Student firm has a goal of creative charity, which is originated from the concept of enterprises of social pattern. Our goal is to collect resources, improve efficiency through business and utilize the profit to make contribution to the society."
    },
    {
      "chnName": "彩虹之下 – 关注自闭症儿童",
      "engName": "Under the Rainbow – Autism Awareness Campaign",
      "chnDesc": 
        "“彩虹之下——关注自闭症儿童”是一个专为架起自闭症儿童和社会沟通桥梁的平台，旨在通过对自闭症知识的普及和宣传打破社会对自闭症儿童的偏见、呼吁社会对自闭症的了解及对自闭症儿童社会现状的关注，鼓励更多人加入到接纳并帮助自闭症儿童的行列中来。此外，我们也为有意愿的人们提供帮助自闭症儿童的机会，通过频繁的志愿者活动及每年定期举行两到三次大型活动，让更多人有机会真正接触到这个群体，用自己的行动真正帮助自闭症儿童融入社会，与社会沟通 – 自闭症儿童并不像彩虹之上的星星那样遥远、孤单、不可捉摸，他们只是需要多一些时间与宽容，我们会发现他们就在我们的身边，如群星般闪耀着光芒。",
      "engDesc": 
        "“Under the Rainbow – Autism Awareness Campaign”  is a platform that serves as the connection between children with autism and the society. We aim to make people aware of what autism is and how the social situation of autistic children is like, thereby encouraging people to take action by accepting and supporting them.  Leading by this aim, we also hope to provide people the opportunities including weekly volunteering activities and annual events to offer help to children with au-tism on their own by getting the children to be in contact with the society. Eventually, you will find that instead of being like lonely the stars far away over the rainbow, they are stars under the rainbow, casting a thousand beams – all they need is just a little more tolerance, patience, and time."
    },
    {
      "chnName": "Asclepius急救医学社",
      "engName": "Asclepius First-Aid Medicine Club",
      "chnDesc": 
        "Asclepius急救医学社第一分支旨在帮助同学提高急救意识，培养急救能力，在遭遇心脏骤停、严重过敏、低血糖、脱水等突发情况时能够有能力自救和救助他人。这种能力将使同学即使不在世外校园 ，在异国的大学也可以受益。第二、三分支为对医学、生理解剖有兴趣的同学提供学习、交流的平台，同时帮助IBDP学生利用学术知识解释并理解急救原理。",
      "engDesc": 
        "Our club aims to raise first aid awareness. We advocate for promoting firs aid as a life skill. We encourage our members to take action during emergency. In understanding the anatomical and physiological mechanisms for various first aid measures, members can have a comprehensive view about first aid in addition to acquiring applicable skills. "
    },
    {
      "chnName": "世外志愿者库",
      "engName": "Volunteer Database of WFLA",
      "chnDesc": 
        "志愿者库旨在给热心公益、喜欢社会实践的所有志愿者们提供多元化的提升自我的平台。无论是否有经验，无论是否有特殊的才能，所有热爱志愿者工作的同学都可以参加志愿者库。因为在志愿者库，志愿者们可以实现从零到一的飞跃。在志愿者库，志愿者们可以参与这些活动：\n中国文化周 | 社团大型活动 | 康健街道金婚 | Charity | 英语节 |\n志愿者库鼓励志愿者们踊跃参与到活动策划和活动执行中来，实践自己的想法，突破自己的舒适圈，在志愿者活动中得到意想不到的收获。",
      "engDesc": 
        "WFLA Volunteer Database  welcomes all the students who have passion in volunteering, no matter skilled or not, experienced or not. The Database is willing to provide different kinds of opportunities for all the volunteers. \nPrevious volunteering activities includes:\nChinese Culture Week|Clubs' activities|50th Wedding Ceremony|Charity Performance|English Festival|"
    }
  ],
  [
    {
      "chnName": "艺术鉴赏社",
      "engName": "Renaissance",
      "chnDesc": 
        "Renaissance艺术鉴赏社是一个旨在提升同学艺术修养、培养良好艺术鉴赏习惯的艺术社团。通过参加每月组织的观赏艺术展览以及观展后的小组讨论，社员们可以从中获取灵感并用文章记录，甚至完成自己的个人作品。Renaissance源于法语的“re-birth”,寓意社员可通过自己与他人的灵感碰撞为自己的作品带来新生。Renaissance同样也为社员的作品提供展示的平台，每次的活动都将展示在社团网页上，条件允许甚至可以为优秀作品举办Renaissance艺术展。",
      "engDesc": 
        "“Renaissance” is composed of a group of high school students that are passionate, enthusiastic towards creative arts. The club focus on increasing member's level of aesthetic knowledge and cultivating the ability to observe and explore artistic works in depth. Through the gallery trips provided by the club, members can draw inspiration in the form of personal reflection and responses, reports and personal projects, communicate and share thoughts via-internet."
    },
    {
      "chnName": "世外舞社",
      "engName": "OA Ultimate Dance Studio",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "Radiation Studio",
      "engName": "Radiation Studio",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "音乐社",
      "engName": "La Musique",
      "chnDesc": 
        "  世外La Musique音乐社，由一群热爱音乐的高中生组成。我们的理念是：用心玩音乐，给喜欢音乐的人提供机会，将音乐带给每一个人，并且借此机会提高中学是艺术修养。\n\n我们的活动包括：日常活动、活动表演、街边卖艺以及举办活动。\n    La Musique每周都会有一次定期的活动，内容包括排练、会议、公众号制作、活动筹备等。La Musique会受邀参加各大高校举办的活动，包括Fashion Show, Charity等等。另外， 我们认为真正的音乐并不一定需要华美的舞台同样也能带给最平凡的每一个人，我们会不定期去街边卖艺。最终，La Musique将会在这学年举办有组织性的表演，扩展音乐圈，并为更多人带来机会。\n\n随着社团的发展，我们颠覆了原来的纯古典乐，将社团变成了一个综合音乐社团。之后，在我们的努力下，我们获得了五星社团提名，并且参加上海市模范性社团展示。\n\n最后，La Musique的活动也具有社会意义，我们尽自己的努力，为社会带来小小的改变。我们参加许多公演，为Charity带来一份力量；我们在街边表演，将艺术传递给社会上的每一个人；我们在大别山与贵州教当地孩子音乐，并与他们进行艺术的交流；我们还提升了中学生的艺术修养。我们相信我们的努力也可以为社会带来正能量。\n",
      "engDesc": 
        "We are music club: La Musique. Our idea is to play the music, provide opportunities for music lovers, spread music and art to everyone and improve the art skills of the high school students.\n\nWe do: weekly activities, performances in different shows, performances on the street and conducting our own activity.\n\nThe weekly activities are consisting of rehearsals, making official WeChat account, conducting activities. Then, we are invited to perform in places including parties, charity, and fashion shows. Also, we perform on the street to spread the art form and share our passion to the society. Finally, La Musique is going to organize an activity this academic year, so as to provide more opportunities for those who are passionate about music.\n"
    },
    {
      "chnName": "OAO 摄影社",
      "engName": "OAO Photography Club",
      "chnDesc": 
        "OAO摄影社(OAO Photography Club)，以风格摄影（stylized photography)为主旨，抛开一贯的依赖技术与设备的摄影思想，将各种艺术领域的内容与摄影结合，创作出属于成员自己的独特风格并定期完成指定风格的project。社团并非注重技术，而是更关注成员观察生活的能力与意识以及想象力。社团同时也提供为别的社团或学校等机构的拍摄活动。社团分为 OAO（Observation and Obsession）与ODC（Observe Discover Capture）两个部门。OAO偏向于艺术摄影，ODC则为纪实摄影，社员将根据不同部门的不同风格进行项目制作。同时社团也以OAO Photography Studio的名义向校内外提供摄影服务。",
      "engDesc": 
        "Our club’s aim is to create “stylized photo” rather than common idea of photography. Club’s members should be able to find their style’s of photography, the theme of their project could include fashion, creativity, arts and photography… Our club claim that “idea” is more important than skill, therefore students who join our club don’t need particular photography skill, however they need to be a thinker and a creator. The club is divided into two departments, which are OAO department (Observation and Obsession) and ODC department (Observe Discover Capture). All the members will create their own photography projects based on a particular style in one of the departments. Our club also provide every association with photography service."
    },
    {
      "chnName": "戏剧社",
      "engName": "Kaleido Theatre",
      "chnDesc": 
        "——你想触摸戏剧的魅力吗？戏剧是人类表演艺术的起源。从戏剧大师莎士比亚笔下的“To be or not to be”到现代戏剧之父易卜生所创作的《玩偶之家》，戏剧的魅力已经在跨时代的艺术长河中织起一道淳厚而唯美的精神底蕴——作为延续和弘扬艺术创作的我们，戏剧是开启一切更是承载梦想的基石。在上一学期中，我们戏剧社自编、自导、自演的首部处女作《往生天堂Rebirth in Heaven》在上海话剧艺术中心进行了首次银幕亮相。我们在聚光灯下感受艺术与真实世界的结合，享受表演过程以及掌声与喝彩。当我们一起携手谢幕时，没有现实的束缚，没有舞台的界限，每一位演员的激情与付出已足以证明我们整个团队的凝聚力与生生不息的艺术之魂。日后，我们将以更为精彩的作品向所有人展示团队宗旨：我们的创作之路是疯狂的，我们的表演空间是自由的，我们对戏剧艺术的追求与热爱是永无止境的——Drama Kaleido永远闪耀！",
      "engDesc": 
        "“The word, the word above all, is truly magical, not only by its meaning, but by its artful manipulation.” Drama is the foundation of human art forms. From William Shakespeare to Henrik Johan Ibsen, thousands of play writers have led us into the charm of drama. And now it’s our obligation for us to inherit their legacy. In the last semester, we brought <Rebirth in Heaven> on the stage of Shanghai Drama Art Center, which is written, directed, and acted all on our own. Incidentally, that debut ended up being one of the most magical and pivotal performances of all in the history of Drama Club. From Drama Club to Drama Kaleido, diverse genres and forms will be blend into this kaleidoscope of performing art. From the international campus to the home campus, we are a bigger team and family. No matter where we are, and no matter what we are called, our passion and devotion for drama will never change. Vive la Drama Keleido!"
    },
    {
      "chnName": "工学美感社",
      "engName": "steAm",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "Dogma95电影社",
      "engName": "Dogma95",
      "chnDesc": 
        "社团旨在通过推荐解析⾼质量电影、普及电影界近期活动、介绍优秀演员、导演，以及科普专业电影术语和理论等方式，让同学能够脱离“娱乐休闲”的框架来看电影。 我们希望能够培养这样一种意识：不要只看电影，要尊重电影，要质疑电影，也要颂扬电影。借助社团活动，本社将会在校园内宣扬一种不一样的电影态度，并拓宽同学的眼界以及对艺术、⽣活乃至世界的认知。",
      "engDesc": 
        ""
    },
    {
      "chnName": "Museholic翻唱社",
      "engName": "Museholic singing club",
      "chnDesc": 
        "Museholic翻唱社的创办旨在给予喜爱音乐、唱歌的高中生展示自我的平台，结识志同道合的音乐爱好者。用音乐和歌声点亮校内外生活，用音乐和歌声发光发热。",
      "engDesc": 
        "Museholic Singing Club aims to provide a platform for every students who love music and singing to show their strengths and passion. We use our songs to lighten the campus, and we use our songs to do charity work as well."
    }
  ],
  [
    {
      "chnName": "The Thinker读书会",
      "engName": "THE THINKER",
      "chnDesc": 
        "一起去窥探翻页间的秘密\n去寻找隐藏在城市角落的俗世故事\n一起在街角，行读人文\n行读社是一个以人文行走为主要活动的可爱社团。我们希望够让虚构的文学世界能够照进现实世界，让同学能够不仅仅从书中去看到一个个故事，更能够通过一次次实地走访，通过倾听一段段口述的过往，去了解，去感知作者当时的经历。由此，对生活、对阅读的作品，都能够有更为深入的感知。我们将从上海开始，记录与宣传即将消失的文化与物质，并将其重新呈现在大众眼前。通过但不限于：地点走访、作者采访等方式，发扬上海的传统文化，留住文化中美妙的记忆。",
      "engDesc": 
        "Let's peep into the secrets between the pages\nTo find the secular stories hidden in the corner of the city\nOn the street corner, let read together \nThe Thinker is a lovely community with humanistic walking as its main activity. We can not only understand the real world through the oral interview, but also understand the real world through the oral interview. Therefore, we can have a deeper perception of life and reading works. Starting from Shanghai, we will record and publicize the disappearing culture and material, and re present them to the public. Through but not limited to: site visit, author interview and other ways to carry forward the traditional culture of Shanghai, retain the wonderful memory of culture."
    },
    {
      "chnName": "汉文化社",
      "engName": "Chinese Culture club",
      "chnDesc": 
        "汉文化，不局限于汉族文化与汉服，而是中华五千年文化的包容。在“衣食筑行”四方面，我们从今天的视角，回溯它的变化。样式纷繁的汉服饰，寄托心意的传统食物，具有地方特点的民居，都是我们生活在汉文化中的体现。基于学期中开展的活动，我们还会在学期末制作汉文化旅游指南，将汉文化的影响力进一步扩大，使大家真正了解、参与、传承汉文化。\n\n与汉文化社一起，在这场浩大的文化浪潮中寻找新的立足点。",
      "engDesc": 
        "Chinese culture is not limited to Han culture and its clothing, but the composition of 5000-year-culture. In the four aspects of Clothing, Food, Architecture and Transportation, we look back on its changes from today's perspective. The various styles of the costumes, traditional food and houses with local characteristics are the symbol of the Chinese culture. Based on the activities carried out, we will also make a guide to Chinese culture tourism at the end of the semester, to further expand the influence of Chinese culture. So that our people can truly understand, participate in and inherit the Chinese culture.\n\nTogether, a new foothold will we seek in this huge cultural tide."
    },
    {
      "chnName": "GI 服装设计杂志社",
      "engName": "GI Fashion Design and Magazine",
      "chnDesc": 
        "我们是世界外国语中学的GI服装杂志社 (Grab It Fashion Design and Magazine)，在两年前由一群热衷时尚的人们创建。社团主要分划为两个部门：设计部，模特部。每一次活动都有两个部门共同参与完成，传统项目分别为：一年一度的Fashion Show，以及出版一年一辑的Fashion Magazine。为了这两项目的进行前期准备活动为：设计师与模特分组，量身设计一套服装，画草图，选面料，找裁缝或自己动手完成服装的制作；设计师为模特搭配服装并集体外出街拍，街拍照片、设计师手稿及采访类文章由编辑部统一制作成杂志。",
      "engDesc": 
        "We are Grab It Fashion Design and Magazine, founded by a group of students passionate in fashion two years ago. \n\nGI is mainly divide into two departments: Design and Model conducting all activities together. \n\nTraditional Activities: Fashion Show conducted every school year (designers team up with the models to create a wearable outfit for the show); Fashion Magazine every school year (designers match clothes for models’ street snap; photos, sketches and articles will be edited into a magazine by the editors). \n\nRoutine: Fashion Sketches every month for discussion; meeting of all three departments; lectures from seniors. "
    },
    {
      "chnName": "拾荒者社",
      "engName": "Stargazers",
      "chnDesc": 
        "围炉夜话，诗色漫旅……\n因爱而寻找星辰掩藏的碎金，\n因梦拾起那些看似脆弱的创作梦，让它们重获新生。\n设计与文字，让轻率得如打草稿的生活苏醒；\n毕竟，文学是人学。",
      "engDesc": 
        "We picked up scattered fragments of stars from the depth of the abyss. “ The Stargazers is a campus club which devotes in original literature and art. Explore our uniqueness in expressing your thoughts and imaginary pieces with the pencil in hand. We strive to create a wonderland for art and literature lovers. We are one of the only clubs on campus who focuses on designing peripheral products. Our products sold in Charity Fair and online services are also available. Stargazers conduct two theme events each semester. Including honor story conducting for Halloween and antique personification last year."
    },
    {
      "chnName": "バナナや香蕉屋",
      "engName": "バナナや",
      "chnDesc": 
        "香蕉屋是世外唯一一个美食类社团，主要活动有新品测评、美食制作以及视频和推文，微信公众号：BNNY香蕉屋，B站名称：香蕉屋バナナ，在这里可以查看我们社团过去的活动。\n提供C与S的时间，欢迎你的加入。",
      "engDesc": 
        "Hi! This is BNNY, we are the only food club in WFLA. Our main activities include new product evaluation, food production, videos and tweets. "
    },
    {
      "chnName": "乱码动漫社",
      "engName": "Bugman",
      "chnDesc": 
        "本社团由有共同兴趣爱好的同学们组建，在世外已有较长的建社时间。社团目的意在由兴趣出发，以动漫文化为载体，通过校内校外的大型活动组织以及社团内部的小型活动的详细规划安排，发挥社员的创新能力、组织能力和合作能力，宣传社团相关文化并在各项活动项目中取得成绩，为校园文化建设和其他相关项目进行服务。社团现在正在努力使同学重新正确认识动漫的意义及其所带来的价值观，提倡同学们合理安排课余生活。",
      "engDesc": 
        "The club is built by the students with the same hobbies and has quite a long history in WFLMS. The club uses the hobbies as starting points and uses the Anime culture as a platform to develop club members’ the ability of creation, organization and cooperation through the detailed plans of the organization of the important activities in and out of the schools, the propaganda of the related culture and the other daily activities. The club hopes to continue to service for the creation of the culture of the campus in WFLMS. The club has made its efforts to bring the correct values of the meanings of the anime and promoted the students to plan their spare time in reason. "
    }
  ],
  [
    {
      "chnName": "世外中学历史社",
      "engName": "WFLA history Club",
      "chnDesc": 
        "本社团坚持用学术活动的方式给所有社员带来分享的快乐。作为一门IB 学科的衍生社团，历史社除了类似课堂的讲座形式活动，还有更多分享式的交流，例如线下历史地标走访，HEMA实践等。在特殊活动时间还有与其他社团的联动，不仅为社员，也为学校其他学生带来有关历史的知识以及交互体验。社团旨在实践过程中让社员获取知识，收获快乐。全部社内活动都由同学自己组织并完成。可以说，历史社团是历史爱好者的不二选择。",
      "engDesc": 
        "WFLA History Club aims to provide joy, love and friendship through academic activities for all the members. As a derivative branch of IB history subject, the club injects platforms for sharing and communicating intotraditional history classrooms. There will be presentations in which students devote themselves to researching, reading and exploring. Meanwhile, the club emphasizes on helping the members to contact with other areas of study, for example, to set up a radio station inside school or to have a held trip in an archeology site. Through these activities, members will broaden their horizons as well as enhance their abilities of planning, organizing and communicating. Honestly, our club is the best choice for those who are impassioned about history."
    },
    {
      "chnName": "生物社",
      "engName": "Bio Club",
      "chnDesc": 
        "作为WFLA创建最早的一批学术类社团，生物社在今年重新出发。我们希望解决校内对生物感兴趣的同学在课内外遇到的一系列学术问题：我们开展课内的IB生物答疑，组织对生物学科竞赛的培训，邀请全国参加iGEM的队伍分享备赛经验……此外，我们与Brain Bee、急救社等校内其他生物类社团保持着密切的合作关系。我们希望生物社能够走出现有的舒适区，让更多人了解到生物的魅力所在。",
      "engDesc": 
        "Being one of the first academic clubs in WFLA, Bio Club is ready again to support biology learners on campus. By providing Q&As for IB biology, delivering lectures on USABO and BBO, and inviting iGEM teams for presentations, we hope to solve your troubles on learning biology both on and after class. Also, we keep a close relationship with other pan-biology clubs. In the coming year, we will strive to work out of our comfort zones and bring the charm of biology to more."
    },
    {
      "chnName": "语言文学社",
      "engName": "Crunchy Zoo Language Club",
      "chnDesc": 
        "想学会如何发出大小舌音吗？想破译十六进制的密码吗？想解构词与句的构成吗？在CrunchyZoo，我们开脑洞，玩逻辑，搞翻译，造字词……\n嘎嘣脆动物园语言社®️创立于2013年，是DP第一批正式社团，同年荣获五星社团。社团宗旨与CAS理念相契合，即立足于本地并走向世界。社团活动主要由三部分构成——学术部专攻语言学奥赛，翻译部自制视频字幕，宣传部用创意打造专属词典……\n语言学，不止学语言。",
      "engDesc": 
        "Crunchy Zoo Language Club was founded in 2013 and awarded the FIVE STAR CLUB◇◇◇◇◇ the very first year of its establishment.\nOur activities are divided into three departments:\na)\tAcademics: devoted on linguistic olympics\nb)\tTranslation: producing captions for YouTube videos\nc)\tWriting: creating dictionaries of our own\nWe are Crunchy Zoo. WE DO LANGUAGE."
    },
    {
      "chnName": "模联社",
      "engName": "Model UN Club",
      "chnDesc": 
        "LET'S MAKE MUN GREAT AGAIN!!! 模联辩论社为2014,2015,2016年的五星社团，宗旨为“持续不断地为世外培养模联、辩论、演讲方面的人才”；我们的社团不仅会利用平日活动来锻炼社员们的能力，还会提供校级到国家级的模联大会与英语辩论比赛供社员们自行选择。我们的社团活动会涵盖但不局限于下列内容：辩题的brainstorm、新闻的分享与讨论、模拟辩论、模拟法庭与模拟参议院的党派辩论。通过这些活动，社员们锻炼了公共演讲能力，提高了解决问题的效率，培养了对于时政的兴趣，并积累了比赛的经验。然而真正给大家带来变化的其实更多的是自信心的增强：模联及辩论都要求我们自信地将自己的想法展现给他人。在进行学术活动之余，我们还会定期玩一个叫做“强权外交”的桌游，来培养社员们对于国际关系及国家间战略的感觉。总之，模联辩论社为喜欢模联、英语辩论、演讲及国际政治的同学提供与同好交流，进而展现、提升自己的平台。",
      "engDesc": 
        "LET'S MAKE MUN GREAT AGAIN!!! The motto of MUN/DEBATE club is “speak for yourself, speak for all”, and through this club, members can gain access to various MUNs and debates ranging from local scales to international scales. During weekly-held club meetings, members can gain experience in debating and public speaking by participating in different club activities, including but not limited to mock trials, mock senate debates, debating brainstorms, and news sharing and discussing. However,MUN/DEBATE club is not only about MUNs and debates; it is more of an attitude, an attitude of constantly caring, thinking, and presenting with confidence. Neither is MUN/DEBATE club all about academic activities: we periodically play a game called “Diplomacy” in order for members to develop abilities to strategize with regard to international relations. What MUN/DEBATE club offers is more like developing a new hobby; every single experienced club members would say that as long as they become familiar with MUNs and debates, they know for a fact that they are already obsessed and that this obsession is never going to cease."
    },
    {
      "chnName": "The BOLTS科技社",
      "engName": "The BOLTS Technology Club",
      "chnDesc": 
        "  本社团是上海市世界外国语中学的FTC竞赛的参赛队。最初建队的五名学生选择队名“The BOLTS”象征着速度与坚固，亦代表着社团对于高效与可靠机器人的期许。社团从2012年开始参加FIRST集团主办的面向16岁起的青少年的科技型比赛FIRST Tech Challenge，这是一项结合了数学、物理、工程、机械和计算机科学等学科的诸多实际技能的国际性赛事，队伍代表学校获得多次奖项，包括2013-2014中国冠军与启迪奖, 以及2015-2018每年上海赛区的冠军联盟奖等。目前谷歌，思科和上海汽车为本社团赞助商。 同时我们还活跃于在上海的其他地方, 基于丰富的科目经验，向青少年科普机器人，工程学的知识。",
      "engDesc": 
        "  The BOLTS robotics club was founded in March 2012, with the help from students, parents, and teachers in school. It was the FIRST Tech Challenge club in Shanghai World Foreign Language Middle School. The five founding students of our club choose our name because “The BOLTS” has the meanings of both lightning and fasteners, which represents our wishes for our robots to be efficient and reliable. The BOLTS has won dozens of awards in FTC, which is a competition requires the best combination of engineering, physics and computer science, our achievements including 2013-2014 Chinese Championship and Inspire Award and we won the Champion League award from 2015-2018, and is currently sponsored by Google and DigiSoft. Furthermore, we also teach high school students all over Shanghai based on our rich knowledge and experience."
    },
    {
      "chnName": "经济社",
      "engName": "Economics Club",
      "chnDesc": 
        "上海市世界外国语中学经济社基于拓宽学生知识面，为学生提供经济学科交流平台，帮助学生在经济学科的学习以及将书本内容应用于现实世界中的理念于2014学年建立，至今已有长达四年的历史。本社团于2016学年开展了多个附属项目以切实达成社团理念及建社目标，目前开展的社内项目包括经济教学视频录制、模拟股市分析以及书籍注解撰写等。并且，本社团与华泾社区共青团关爱农民工子女志愿服务行动项目组织“七彩小屋”达成了长期合作项目，在七彩小屋进行周期性的免费教学，切实为社区服务做出贡献。",
      "engDesc": 
        "The World Foreign Language Academy Economics Club is founded in 2013 based on the idea of broadening students' horizon, providing a platform for communication between students around the subject of Economics, offering assistance for students' study of Economics, and taking theories into reality. The four-year-long history of the club enables the multi-program system to be carried out. Current sub-programs of the club include Crash Course Video Recording, Mock Stock Market Analysis and Book Analysis & Reflections, which all serves to accomplish the goal and the idea of The WFLA Economics Club. In addition, the club also established a long-term cooperation relationship with CYL Migrant Worker Children Caring Voluntary Sevices Program \"The Polychrome House\", to hold classes at \"The Polychrome House\" periodically, and earnestly contribute to Community Services."
    },
    {
      "chnName": "法国文化社",
      "engName": "Le Nord",
      "chnDesc": 
        "    “法语社”，给世外学习法语的人群提供法语角。法语阅读，制作海报，撰写微信号、集体外出活动的发掘自己法语新高度的活动，以能提高自己本身的法语能力为基础和动力，让法语社成为能够让本校甚至校外学习法语的同学们提升法语水平的平台！了解法国文化是其中的重要一环。在世外中学，不乏被法国文化深深吸引的同学。围绕法国文化的浪漫气息，法语社将通过艺术、历史、歌曲、电影以及美食等方面让同学们更好得通过自己的感官发现法国的“美”。暂定每个月都会有一个特定的主题，每周法语社将会开展维持1小时的互相交流时间。期间，社员将通过看书、看电影、品尝美食等各种自主学习的方式，预先了解与本月主题相关的法国历史、文化、美食、电影等多方面，也可以有感而发为感兴趣的主题写一些随笔和心得。我们将通过绘制海报和“FranceFranche”的微信号的平台来汇报社团活动从而展示社员成长心得。",
      "engDesc": 
        "Our purpose of holding French Club is to gather students studying French in WFLMS to develop the ability to use French as a speaking language. We provide the chance for students studying French to read proper French story books, to create a French corner, to express own thoughts about French, etc. Familiarizing with French culture is another important process of learning French. In our school, there are plenty of students who are totally fascinated by French culture. In order to know France better, we will advertise French culture by combining our French salon inside school with activities organized by Shanghai French Alliance outside school. We tentatively decide to set one theme per month. Club members will preview the theme of the month by reading, watching movies, having snacks, etc. During the every-week sharing time, we will then discuss the theme in groups. We will also offer site visits once a month according to the plan. We plan to show our activities and members’ learning experience by designing posters and writing some articles on wechat at the end of the first semester."
    },
    {
      "chnName": "化学社",
      "engName": "ChemiLab",
      "chnDesc": 
        "\"离开化学实验室，我的心脏就无法跳动。\"\n——维勒\n化学社是一个传承已久的社团。创社之初，本社便以培养同学们对化学的热爱为己则，并以将自然科学的客观真理性和人文性贯彻于本社组织的活动之中为始终的目标。\n本社的活动主要为：化学实验、化学应用和化学理论科普。\n化学实验是本社的主要活动，通常通过做实验来使同学们了解一种物质的特性，或者了解一个很有特征的化学反应。\n本社偶尔也会举办小workshop，各社员可以运用自己的化学理论知识来制作一些作品，例如变色墨水等，用严谨而不失趣味的方式一同学习化学。\n最后，化学社能够容纳怀有不同目标的同学：无论是希望感受化学的乐趣或是想要提高管理能力，我们都非常欢迎！\n\n\n\"世间最大的快乐，莫过于发现世人从未见过的新物质。\"\n——舍勒\n\n衷心希望各位能在化学社感受到身为化学学习者的骄傲与快乐。\n",
      "engDesc": 
        "Always remember C3H3:\nClear Head +Clever Hands +Clean Habits\nbecause it never exists without your attention\n\n"
    },
    {
      "chnName": "辩论社",
      "engName": "Debate Club",
      "chnDesc": 
        "辩论，是精湛的逻辑、美好的表达，是语言和灵气的搏斗，是寻找答案的艺术。\n二零二零年夏天，辩论社拿下了亚洲顶级赛场上的最好战绩——亚洲杯季军。辩论带给我们的不仅是绽放光芒的赛场，更是自我认知的机会，真正认识自己口中语言的深度和力量。\n汉娜·阿伦特说：“有辩论的地方，权威就暂时失声。”在辩论场上，我们磨去心中带有海拔的固见、念想，旋转起内心认知世界的方向，为所有看似荒谬的事物辩护，为一切需要辩护的立场伸张价值。\n在观点和表达的碰撞中，你终究会懂得那件事、那个人、那个你寻找的答案。",
      "engDesc": 
        ""
    },
    {
      "chnName": "拓科传媒",
      "engName": "TechoMedia",
      "chnDesc": 
        "STEM圈氛围浓厚，却似乎像一个围城，城里的技术宅们各司其职，城外的小白们望眼欲穿，却又望尘莫及。于是, techo的初创团队 针对这一现状，在五年前，创建了Techomedia 拓科传媒。\n\n在过去，Techomedia发布380余篇科技推文，总阅读量逾38万；我们也出席各类展会和宣讲会10余次，协办5场大型科技赛事；\n\n未来，Techomedia将不受限于从前，一如既往地跳出舒适区，发起更具多元化和包容性的STEM活动，扩大组织的全国影响力；同时Techo希望与更多的学生科技社团、学生组织、社会科技企业、民非组织展开合作，组织更具影响力的科技活动，给更多的中国青年带去科技的乐趣，让每一个创新的想法，都能得到不容小觑的力量。",
      "engDesc": 
        "Established in August 2015, TechoMedia is the very first student-oriented STEM student media in China. Our mission is to provide a platform to unite talented students interested in STEM-related areas and combine their efforts together, so that they can find their peers and improve together by communication and cooperation. What’s more, TechoMedia also devotes to gathering the best available resources for those who are interested in STEM-related subjects and majors, offering them a chance to start their journey along this path. \n\nAs a STEM-related media, TechoMedia is using various online platforms to spread influence among the students. Meanwhile, TechoMedia engages in STEM activities such as Google App Inventor Contest, HackShanghai Hackathon, Invention Convention Worldwide, etc., serving as the partnered student media and co-host.\n\nTechoMedia is not merely an influential student media. Our ultimate goal is to build a platform and a nationwide student STEM community. This year, we’ve partnered with several influential social enterprises and student organizations to help us move forward and spread our philosophy."
    },
    {
      "chnName": "阁楼",
      "engName": "ATTIC",
      "chnDesc": 
        "ATTIC组织是一个学生创办，以“创客”概念为主题的校际联盟社团。活动、科技、发明、创造是我们对于创客的定义。ATTIC希望为那些尚未确定自身努力方向的同学提供一个尝试的机会，同时为已经有兴趣的同学提供交流、实践、发展的平台。ATTIC的目标是鼓励更多“创客”产生，并用他们的成品使生活变得更为便捷，改变人们对于创新的看法：其实创新就在身旁，需要的只有他们的双手来实现灵感。 ATTIC对于自身的定位是校际联盟社团，即建立各分社，吸引更多的学生关注创新。ATTIC核心团队将一直致力于打造更有吸引力、影响力的平台作为首要目标。\n",
      "engDesc": 
        "\"ATTIC is a club of an aggregation of innovative, creative and helpful makers. It aims to establish a new platform for innovation and cultivate a \"maker culture\". Specifically, ATTIC provides students of creative ideas with platforms for turning their thoughts into reality by technology; resources to make it accomplished and opportunities to introduce and publicize the product in a larger scale to serve a better life.\n\nDaily club activities include brainstorming new ideas of innovation, developing the product through academic experiments and researches, associating with corporations and student organizations to introduce the products and attending product-development contests. Up to now, the core team of ATTIC has already contacted Shanghai Nanyang Modal School, Secondary School Attached To East China Normal University and High School Affiliated to Fudan University to reach an agreement on founding sub-clubs in their school. Besides, Pragmatists and the ATTIC together formed an alliance, in which the former gives out demands in people’s daily life and practical theories and the latter makes it into reality by technology.\n\nThe primary steps are practiced smoothly and the ATTIC is impressed by the hospitality towards technology and demands for creation by students from three high schools in Shanghai themselves. Therefore, in the future, the ATTIC will follow the core spirit of “maker culture” and expand the size and influence on more students interested in.\"\n"
    },
    {
      "chnName": "起源",
      "engName": "Origin",
      "chnDesc": 
        "本社团将通过同伴教育，将生理健康的知识对我校十年级及以上的学生进行普及，使他们在毕业之前对于“性”这一一直以来被隐晦起来的字眼拥有正确的认知，而在之后的大学生活中具备这方面的自我保护能力。本社团的主要活动分成两个部分，其一是对社团成员对于收集的资料的讨论与整理，再通过学校展板、微信公众平台等方式进行宣传与普及。其二是通过大量的社会调查问卷数据的采集，以此形成一套对于当下学生对于性意识的认知体系以及相对的心理框架。\n",
      "engDesc": 
        " Our club is going to devote itself popularizing the physical health knowledge through the peer education, towards to the tenth grade students and above in our school. In this way, they can have a better understanding on the word \"sex\" with the right knowledge, and with the ability to protect themselves in this regard after the college life. The main activities of the society is divided into two parts, one is for community members to discuss information gathered and improvement, through a powerful dissemination, using the school boards, micro-channel public platform, etc. The second part is to form a cognitive system for current students and opposing psychological framework consciousness through a large number of social survey questionnaire collected data.\n"
    },
    {
      "chnName": "模拟法庭社",
      "engName": "Mock Trial",
      "chnDesc": 
        "模拟法庭是以英美法系为基础的当庭辩论，是一项美国高中非常流行的课外活动。一支队伍由6名学生组成——3位律师和3位证人。参赛者在比赛之前要仔细研究下发的案例，从证物、证人之间找出对于自己最有力的证据，同时准备好控方及辩方去引导法官做出最有利的裁决。对于那些将来不从事法律专业的参与者，这是非常具有价值的一项活动。模拟法庭在思维逻辑，公共演讲和临场团队合作都十分具有挑战性。在模法社，参与者将有丰富的机会通过不断地研究案件，团队讨论和文件写作来提升自己各方面的能力。对于以后乐意从事法律专业及对纯粹学术研究的学生，模法社是最好的选择之一。\n",
      "engDesc": 
        "Mock Trial is an extracurricular in American High schools in which students participate to take on the roles of attorneys and witnesses to compete against each other in courtrooms. Every team consists of 6 members, 3 attorneys and 3 witnesses. All contestants study the case beforehand, draw favorable evidence from the exhibits and witnesses’ testimonies, prepare for both prosecution and the defense side and serve the justice to persuade the judge to make the most favorable final verdict. For those students who following paths other than being lawyers, it is a very valuable experience because Mock Trial is very challenging in critical thinking, public speaking and team collaboration under immediate pressure. In this Mock Trial Club, members have abundant opportunities to improve their own abilities to logically think and write by studying cases and group discussing. For students whose interests in having a legal profession or academic research, Mock Trial is one of their best choices.\n"
    },
    {
      "chnName": "世外英语辩论社",
      "engName": "WFLA Debate League",
      "chnDesc": 
        "\"世外英语辩论社的宗旨是“持续不断地为世外培养辩论方面的人才”；在打好每一场辩论赛的同时，不只是带领好下一届，更是要将辩论的技巧和热忱传递给后继的世外学子。\n我们的社团不仅会利用平日活动来锻炼社员们的能力，还会提供市级，全国级以及全美辩论比赛供社员们自行选择。我们的社团活动会涵盖但不局限于下列内容：辩题的、即兴演讲、研究的方式方法，辩论稿的整理修改，公开论坛的练习，交战的练习和导师点评。通过这些活动，社员们锻炼了公共演讲能力，锻炼了议题分析能力和思维辩证能力，提高了解决问题的效率，培养了对于辩论的兴趣，更在一次次比赛中积累了经验，得到了成长。然而真正给大家带来变化的其实更多的是自信心的增强：辩论要求我们自信地将自己的想法展现给他人，要求我们有随机应变的能力。\n我们的社团不仅仅是关于英语辩论，更是一种态度，一种持之以恒的态度，一种展现自我的态度，一个思考者的态度。我们会培养出一批真正热爱辩论的人，并将这份热情传递给每一届世外人。\"\n",
      "engDesc": 
        " The motto of WFLA DEBATE League is “speak for yourself, speak for all”, and through this club, members can gain access to various debate competitions ranging from local scales, national scales to international scales. During weekly-held club meetings, members can gain experience in debating and public speaking by participating in different club activities, including but not limited to Lincoln-Douglas debates, mock debates, free debate, cross fire and debating brainstorms. However, WFLA Debate League is not only about debates and competitions; it is more of an ATTITUDE, an attitude of constantly caring, thinking, and presenting with confidence. What WFLA debate league offers is more like the development of a new hobby; every single experienced club members would say that as long as they engage in debates, they know for a fact that they are debaters, and their passion and enthusiasm for debate is never going to end.\n"
    },
    {
      "chnName": "Teleskop德语社",
      "engName": "Teleskop",
      "chnDesc": 
        "Teleskop（德国镜象）是世外中学学生建立的德国文化传播媒体，为上海乃至中国热衷德语和德国文化的学生搭建了解德国，接触德语并进一步提高语言水平的平台。",
      "engDesc": 
        "Teleskop (Teleskop) is a German cultural media established by students from WFLA. It provides a platform for students from Shanghai and China who are interested in German and German culture to learn more about Germany, get in touch with German and further improve their language skills."
    },
    {
      "chnName": "Luminosity光度社",
      "engName": "Luminosity",
      "chnDesc": 
        "      光度心理社可以为心理学爱好提供一个学习交流的平台，促进学生群体对心理学的了解，学会用科学的知识和方法帮助自己和他人。\n       我们会通过社团活动，提高同学们的自主学习和探究能力，同时在学习之后能够像老师一样来解释概念和知识点也能锻炼同学们的与组织和表达能力。在演讲中要求同学们设置生活中的场景来辅助解释概念，能够增长他们的思维能力也让他们学会将知识联系并运用到现实生活。\n      本社团将以定期进行课题的研究报告制作，在调查学生心理及日常行为同时，锻炼社员们关于问卷制作，收集数据、分析结果的方式。\n      我们可以给社团成员提供心理学相关的校外项目去进行实践体验。我们在上师大找到了教授，可以每月为我们提供心理实验室进行实验与相关的学习，帮助我们更好的了解心理。上述的社团活动能培养同学之间的团队合作能力，实践能力，以及沟通能力。我们也会对他们的心得和发现进行整合记录。\n       光度心理学社的眼界不单单停留在心理学理论的层面上。我们更希望能够以社团为媒介，在社团和校园内宣扬一种学术精神：一个探究者，调研者和团队一员的精神——勤奋、热情、专注。我们希望在找到志同道合的同伴时也能给对心理学有兴趣有热情的学生提供一个来继续探索这个神奇的领域的机会，并将这种学术精神传递下去。\n\n",
      "engDesc": 
        "     Luminosity aims to provide a platform for students to learn and communicate with each other, promote students' understanding of psychology, and help themselves and others with scientific knowledge and methods.\n    We will improve students' independent learning and exploration ability through club activities. At the same time, we will be able to explain concepts and knowledge points like the teacher and exercise students' ability of organization and expression. In the speech, students are asked to set up scenes in their lives to help explain concepts, which can increase their thinking ability and enable them to learn to relate knowledge and apply it to real life.\n    The club will make regular research reports on the subject, and train members to make questionnaires, collect data and analyze results while investigating students' psychology and daily behaviors.\n    We can provide community members with psychology-related off-campus programs to practice. We found a professor in normal university, who could provide us with a psychological laboratory for experiments and related studies every month to help us better understand psychology. The above club activities can cultivate teamwork, practice and communication skills among students. We also document their experiences and discoveries.\n     Luminosity's vision is not just about psychological theory. We hope to promote a kind of academic spirit in the community and campus with the community as the medium: the spirit of an inquirer, investigator, and team member -- diligence, enthusiasm and concentration. We hope that finding like-minded peers will also provide students with an interest and passion for psychology with an opportunity to continue to explore this amazing field and pass on the spirit of scholarship."
    },
    {
      "chnName": "日语社",
      "engName": "HIBIKI",
      "chnDesc": 
        "日语社旨在让更多同学能认识并了解日语以及日本文化，同时给对日本文化和日语学习感兴趣的同学提供一个交流平台，让大家能够表达自己的观点与兴趣爱好，也希望能够帮助正在学习日语或想学习日语的同学们。社团活动主要有：每月专题文化研究、HIBIKI字幕组、大型线上/线下活动+总结推文、日语学习和文化普及系列推文。",
      "engDesc": 
        "Japanese club aims to let more students know and understand Japanese and Japanese culture. We provide a platform for students who are interested in Japanese culture and Japanese learning, so that they can express their views and interests. We also hope to help students who are learning Japanese or want to learn Japanese. The club activities mainly include: monthly thematic cultural research, HIBIKI subtitle group, large online/offline activities + summary tweets, Japanese language learning and cultural popularization series of tweets."
    },
    {
      "chnName": "物理社",
      "engName": "Physics Society",
      "chnDesc": 
        "物理社旨在增加学术的普及性和趣味性，在探索新知的同时挖掘自己的兴趣，发展自己对物理的见解。在这里，你们不会见到满黑板的复杂公式，在这里，你可以在实验中结识新交，在这里，你可以与学长学姐同享物理乐趣，同时，你也可以体验浪漫，感受艺术，体会物理背后的万物之美。在物理社，每个人可以畅所欲言，可以天马行空，可以肆意探索。物理可以是光，照进每个人的世界，欢迎每一位前行者的到来！",
      "engDesc": 
        "Physics society aimed to increase the universality of academy and the enjoyment brought by learning physics. We encourage you to explore anything new and in the meantime motivate personal interest and develop understanding about physics. Here, you won't see boards filled with complicated formulas, you can meet like-minded people and make friends with them, what's more, you can share your thought regarding physics with any of us. In physics  society, no one is limited to share his/her own idea, so feel free to explore and challenge yourself.  Last, welcome to the field of physics, dear forerunners!"
    },
    {
      "chnName": "笔墨知音书法社",
      "engName": "PENMANSHIP ECHOES",
      "chnDesc": 
        "欢迎来到书法的世界！\n我们从事中英文书法的创作与鉴赏，同时对书法文化的作用与意义进行深度的研究;\n我们是上海的所有中学中唯一开设英文书法学习的社团。\n我们致力于引领新手入门，为爱好者提供交流平台，为书法的传播贡献一份力量。\n如果你爱好艺术与书写，那就来成为我们的一员吧！\n",
      "engDesc": 
        "Welcome to the world of calligraphy! \nWe are Penmanship Echoes, an asylum of the hidden beauty of penmanship. \nWe are engaged in the creation and appreciation of Chinese and English calligraphy, as well as in-depth research on the role and significance of calligraphy culture, and is the only school club of all the middle schools in Shanghai to engage in the study of English calligraphy. \nWe are willing to lead beginners, provide communication platform for calligraphy lovers, and contribute to the spread of calligraphy, which is so appraling and of.\nWe warmly welcome you to take the first steps towards the journey of being a master penman!"
    },
    {
      "chnName": "脑神经科学社",
      "engName": "Brain Bee Club",
      "chnDesc": 
        "脑神经科学是当今世界上最热门，也是最有发展前景的科学领域之一。Brainbee club的成员们因为国际脑神经大赛Brain Bee 而结识，为了能够共同探究，并普及脑神经科学的相关知识而创办了此社团。我们的目标不仅仅只是提升参加brainbee的团队的学术能力及团队凝聚力，更希望能够让更多的人了解到神经科学的奥秘，将我们对于神经科学的热爱感染到更多的人。",
      "engDesc": 
        ""
    },
    {
      "chnName": "世外哲学社",
      "engName": "The Peripatetic Society",
      "chnDesc": 
        "世外哲学社别名“游荡社会”。致力于培养学生的理性思维和尽可能了解秩序美学，以独特视角解读名著与世界，达成精神上的深造和艺术历史上的共鸣。追求柏拉图式的冒险旅程，在一段相对安静的时间里把平常做成极致，以“千字”记录生活片段，产生爱、美、丑、恶的不同，与拥有相同兴趣的人们一起讨论，于是经过漫长的等待，一定会有意想不到的收获。",
      "engDesc": 
        "Philosophy outside the world community alias \"The Peripatetic Society\". It is devoted to cultivating students' rational thinking and understanding of order aesthetics as much as possible, interpreting masterpieces and the world from a unique perspective, and achieving spiritual further study and resonance in the history of art. The pursuit of Platonic adventure journey, in a relatively quiet period of time to make the ordinary to the extreme, to \"1000 words\" recording life fragments, produce the difference between love, beauty, ugliness, evil, and people with the same interest to discuss together, so after a long wait, there will be unexpected harvest. "
    },
    {
      "chnName": "世外头马",
      "engName": "WFLA Toastmaster",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "WFLA 数学社",
      "engName": "WFLA MathClub",
      "chnDesc": 
        "社团活动主要为建模，竞赛培训为主。其中间或会穿插着数学趣味知识补充、推文撰写，以及高数交流。重点针对比赛AMC以及HiMCM,以及IMMC，让同学们在建模以及数学竞赛上有所收获，有所斩获。",
      "engDesc": 
        "Our clubs focus on modeling and many other math competitions. However, as we're rather concerned about the depth of knowledge and club members' passion towards math, we're adding more including official article and interesting knowledge.\nOur activity takes effect as our club members achieve great honor in competitions like AMC HiMCM, and IMMC."
    },
    {
      "chnName": "科幻社",
      "engName": "Science-Future Club",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "凌枫社",
      "engName": "Story Upon the Maple",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "商业社",
      "engName": "WFLA Business Club",
      "chnDesc": 
        "世外商业社（WFLA Business Club）是世界外国语中学Academic类社团，旨在带领想要在商业领域探索的同学系统性地学习商业类知识，参与例如FBLA等顶尖的高含金量商业类比赛。\n同时，我们希望同学通过商业方面的学习，能在实际生活中灵活运用商业知识解决问题，更好地规划自己的未来发展方向",
      "engDesc": 
        "WFLA Business Club is the Academic association of the World Foreign Language Middle School. It aims to lead students who want to explore in the field of Business to systematically learn Business knowledge and participate in top high-quality Business competitions such as FBLA.\nAt the same time, we hope that students can use business knowledge to solve real life problems and better plan their future development direction through studying business"
    },
    {
      "chnName": "思源社",
      "engName": "Sociology Club",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    },
    {
      "chnName": "Pantheon學術社",
      "engName": "Pantheon Scholastic Union",
      "chnDesc": 
        "Pantheon学术社聚焦国际顶级社科竞赛，如USAD美国学术十项全能，NEC全美经济挑战赛，FBLA美国未来商业领袖，BPA美国全能商业精英，等国际顶尖竞赛。\n我们是一个梦想家的社团，一个实干家的社团，一个拼搏者的社团，2021，让我们向更远的彼方前进！",
      "engDesc": 
        "This is a club of dreams and competence, of stamina and courage, of teams and brilliance. We will travel further, we will see clearer, and we will have reach that impeccable horizon with steps unfaltering, and become the best we can be."
    },
    {
      "chnName": "英文报社",
      "engName": "WFLA Bulletin",
      "chnDesc": 
        "",
      "engDesc": 
        ""
    }
  ],
  [
    {
      "chnName": "世外传媒",
      "engName": "WFLA Media Group",
      "chnDesc": 
        "世外传媒是世外目前最大的非官方校园新闻互动传播媒体。世外传媒的意义在于带着已有的资源和口碑，传承发扬一个属于世外学生创造自我价值、产生影响力的平台。我们负责报导校内外的新闻，有效有质地传播校园资讯、宣扬校园文化。社团栏目例如学长学姐说希望可以帮助大家找到努力与热爱的意义，去激励个人成长；还接收同学老师的来稿进行互动，让世界倾听世外学生的声音。",
      "engDesc": 
        ""
    }
  ]
]
